Revit 2015 API
Element Members
The Element type exposes the following members.
Methods
Name | Description
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
CanBeHidden
Indicates if the element can be hidden in the view.
CanBeLocked
 Identifies if the element can be locked.
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
CanHaveTypeAssigned(Document, ICollection<ElementId>)
 Checks if all elements in the set can have a type assigned.
ChangeTypeId(ElementId)
 Changes the type of the element.
ChangeTypeId(Document, ICollection<ElementId>, ElementId)
 Changes the type of all elements in the given set.
DeleteEntity
 Deletes the existing entity created by %schema% in the element
Dispose
Releases all resources used by the Element
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
GetChangeTypeAny
 Returns ChangeType associated with any change in an element.
GetChangeTypeElementAddition
 Returns ChangeType associated with element addition
GetChangeTypeElementDeletion
 Returns ChangeType associated with element deletion.
GetChangeTypeGeometry
 Returns ChangeType associated with a change in the geometry of an element
GetChangeTypeParameter(ElementId)
 Returns ChangeType associated with a change in a parameter's value
GetChangeTypeParameter(Parameter)
 Returns ChangeType associated with a change in a parameter's value
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
GetMaterialIds
 Gets the element ids of all materials present in the element.
GetMaterialVolume
 Gets the volume of the material with the given id.
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
GetOrderedParameters
 Gets the parameters associated to the element in order.
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
GetParameters
Retrieves the parameters from the element via the given name.
GetPhaseStatus
 Gets the status of a given element in the input phase
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
GetValidTypes()
 Obtains a set of types that are valid for this element.
GetValidTypes(Document, ICollection<ElementId>)
 Obtains a set of types that are valid for all given elements.
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
IsExternalFileReference
 Determines whether this Element represents an external file.
IsHidden
Identifies if the element has been permanently hidden in the view.
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
IsValidType(ElementId)
 Checks if given type is valid for this element.
IsValidType(Document, ICollection<ElementId>, ElementId)
 Checks if given type is valid for the set of elements.
LookupParameter
Attempts to find a parameter on the element which has the given name.
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
CreatedPhaseId
 Id of a Phase at which the Element was created.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
DesignOption
Returns the design option to which the element belongs.
Document
Returns the Document in which the Element resides.
Geometry
Retrieves the geometric representation of the element.
GroupId
 The id of the group to which an element belongs.
Id
 A unique identifier for an Element in an Autodesk Revit project.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LevelId
 The id of the level associated with the element.
Location
This property is used to find the physical location of an element within a project.
Name
A human readable name for the Element.
OwnerViewId
 The id of the view that owns the element.
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
Parameter[String]
Retrieves a parameter from the element given its name.
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
Pinned
 Identifies if the element has been pinned to prevent changes.
UniqueId
 A stable unique identifier for an element within the document.
ViewSpecific
 Identifies if the element is owned by a view.
WorksetId
 Get Id of the Workset which owns the element.
See Also
Element Class
Autodesk.Revit.DB Namespace